---
type: EnergyAnalysisWindowType
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 7
tags: [revit-api, class]
---

# EnergyAnalysisWindowType

`Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetSolarHeatGainCoefficientsForSolarIndicientAngles | 2024 | `public IDictionary < double , double > GetSolarHeatGainCoefficientsForSolarIndicientAngles ()` |
| Property | Description | 2024 | `public string Description { get ; }` |
| Property | HeatTransferCoefficient | 2024 | `public double HeatTransferCoefficient { get ; }` |
| Property | Parameter | — | `` |
| Property | SolarHeatGainCoefficient | 2024 | `public double SolarHeatGainCoefficient { get ; }` |
| Property | Transmittance | 2024 | `public double Transmittance { get ; }` |
| Property | WindowTypeName | 2024 | `public string WindowTypeName { get ; }` |